---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussDuplicateEngineeringType
source: html/9f59960a-bf96-8e42-fdbb-362728f61208.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussDuplicateEngineeringType Property

Elements have duplicate 'Engineering Type' values.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussDuplicateEngineeringType { get; }
```